org-file.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-16 Thu 11:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="unknown" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6315716">1. Levels of heading</a></li>
<li><a href="#orgcbd9178">2. h1</a>
<ul>
<li><a href="#org2b28020">2.1. h2</a>
<ul>
<li><a href="#org591ba2b">2.1.1. h3</a></li>
</ul>
</li>
<li><a href="#orge36d400">2.2. types of list</a>
<ul>
<li><a href="#org6ba2b22">2.2.1. unnumbered type 1</a></li>
<li><a href="#orgc3a2685">2.2.2. unnumbered type 2</a></li>
<li><a href="#orgf59093e">2.2.3. numbered list 1</a></li>
<li><a href="#orgf81e84d">2.2.4. numbered list 2</a></li>
</ul>
</li>
<li><a href="#org04d3a93">2.3. Text formatting</a></li>
</ul>
</li>
<li><a href="#orge197908">3. Source Blocks</a>
<ul>
<li><a href="#org8ba8d9f">3.1. Links</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6315716" class="outline-2">
<h2 id="org6315716"><span class="section-number-2">1</span> Levels of heading</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
<div id="outline-container-orgcbd9178" class="outline-2">
<h2 id="orgcbd9178"><span class="section-number-2">2</span> h1</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2b28020" class="outline-3">
<h3 id="org2b28020"><span class="section-number-3">2.1</span> h2</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org591ba2b" class="outline-4">
<h4 id="org591ba2b"><span class="section-number-4">2.1.1</span> h3</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="org0f98171"></a>h4<br />
<ol class="org-ol">
<li><a id="org43aa588"></a>h5<br />
<ol class="org-ol">
<li><a id="org46558a6"></a>h6<br />
<ol class="org-ol">
<li><a id="org46d1058"></a>h7<br />
<ol class="org-ol">
<li><a id="orga114e80"></a>h8<br />
<ol class="org-ol">
<li><a id="orgdba5696"></a>h9<br />
<div class="outline-text-10" id="text-2-1-1-1-1-1-1-1-1">
<p>
Org comments start with # on a newline and do not get rendered when exported as html
</p>
</div>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-orge36d400" class="outline-3">
<h3 id="orge36d400"><span class="section-number-3">2.2</span> types of list</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org6ba2b22" class="outline-4">
<h4 id="org6ba2b22"><span class="section-number-4">2.2.1</span> unnumbered type 1</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>org list</li>
<li>org in emacs</li>
</ul>
</div>
</div>
<div id="outline-container-orgc3a2685" class="outline-4">
<h4 id="orgc3a2685"><span class="section-number-4">2.2.2</span> unnumbered type 2</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>no number</li>
<li>2nd list end</li>
</ul>
</div>
</div>
<div id="outline-container-orgf59093e" class="outline-4">
<h4 id="orgf59093e"><span class="section-number-4">2.2.3</span> numbered list 1</h4>
<div class="outline-text-4" id="text-2-2-3">
<ol class="org-ol">
<li>text 1</li>
<li>text 2</li>
</ol>
</div>
</div>
<div id="outline-container-orgf81e84d" class="outline-4">
<h4 id="orgf81e84d"><span class="section-number-4">2.2.4</span> numbered list 2</h4>
<div class="outline-text-4" id="text-2-2-4">
<ol class="org-ol">
<li>text 1</li>
<li>text 2</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org04d3a93" class="outline-3">
<h3 id="org04d3a93"><span class="section-number-3">2.3</span> Text formatting</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<span class="underline">underlined text</span>
<del>strike-through-text</del>
</p>

<p>
<b>bold-text</b>
<i>Italic</i>
<code>code</code>
<code>verbatim/unformatted-text</code>
</p>
</div>
</div>
</div>


<div id="outline-container-orge197908" class="outline-2">
<h2 id="orge197908"><span class="section-number-2">3</span> Source Blocks</h2>
<div class="outline-text-2" id="text-3">
<p>
Type <code>&lt; s tab</code> to add an empty source block
</p>
<div class="org-src-container">
<pre class="src src-elisp"># how to get this block's or entire export's background-color to black?
  (<span style="color: #00ffff;">defun</span> <span style="color: #87cefa;">hi-org</span> ()
    (print <span style="color: #ffa07a;">"Hello org"</span>))
</pre>
</div>
<p>
Use <code>' C-c</code> to edit code in it's default language mode.
Evaluate code with <code>C-c C-c</code>
</p>
</div>

<div id="outline-container-org8ba8d9f" class="outline-3">
<h3 id="org8ba8d9f"><span class="section-number-3">3.1</span> Links</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The format is two square brackets inside a square bracket <i>without space</i> <code>[ [my-awesome-link-here][text-to-show-here]]</code>
<a href="https://orgmode.org/worg/org-quotes.html">org-quotes</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: unknown</p>
<p class="date">Created: 2018-08-16 Thu 11:43</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
